GBert/misc/pickle-ftdi/src/pic24.h
/*
 * Copyright (C) 2005-2016 Darron Broad
 * All rights reserved.
 *
 * This file is part of Pickle Microchip PIC ICSP.
 *
 * Pickle Microchip PIC ICSP is free software: you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as published
 * by the Free Software Foundation.
 *
 * Pickle Microchip PIC ICSP is distributed in the hope that it will be
 * useful, but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with Pickle Microchip PIC ICSP. If not, see http://www.gnu.org/licenses/
 */

#ifndef _PIC24_H
#define _PIC24_H

/******************************************************************************
 * 24-bit CONFIGURATION
 *****************************************************************************/

#define PIC24_MASK (0x00FFFFFF)
#define PIC24_CALIB_MAX  (256)
#define PIC24_CONFIG_MAX (256)
#define PIC24_FUID_MAX   (255)

struct pic24_config {
	uint32_t appid;				/* 8005BE OR 8007F0	 */
	uint32_t calib[PIC24_CALIB_MAX];	/* CALIBRATION WORDS 	 */
	uint32_t config[PIC24_CONFIG_MAX];	/* CONFIG BYTES/WORDS	*/
	uint32_t fuid[PIC24_FUID_MAX];		/* UNIT/FUID BYTES/WORDS */
	uint32_t deviceid;			/* FF0000 		 */
	uint32_t revision;			/* FF0002 		 */
	char pepath[STRLEN];			/* PE FILE PATH		 */
	/* required for program verify mode entry and device detection	 */
	uint16_t tblpag;			/* TBLPAG REGISTER ADDR	 */
	uint16_t nvmcon;			/* NVMCON REGISTER ADDR	 */
	uint16_t visi;				/* VISI REGISTER ADDR	 */
	uint8_t tblnop;				/* TBL READ NOP COUNT	 */
	uint8_t gotonop;			/* GOTO NOP COUNT	 */
};

/* NVM register addresses */
#define PIC24_NVMCON	(pic24_conf.nvmcon)
#define PIC24_NVMADR	(pic24_conf.nvmcon + 2)
#define PIC24_NVMADRU	(pic24_conf.nvmcon + 4)
#define PIC24_NVMKEY	(pic24_conf.nvmcon + 6)

struct pic24_dstab {
	uint32_t datasheet;
	char filename[STRLEN];
	uint8_t appid;
};

struct pic24_dsmap {
	char devicename[STRLEN];
	uint16_t deviceid;
	uint32_t flash;		/* flash size in words                   */
	uint16_t eeprom;	/* eeprom size in bytes 0=unsupported    */
	uint32_t datasheet;
	uint32_t configaddr;    /* CONFIG BASE                           */
	uint8_t nconfig;	/* NUMBER OF CONFIG WORDS AT CONFIG BASE */
	uint32_t fuidaddr;	/* UNIT/FUID BASE                        */
	uint8_t nfuid;		/* NUMBER OF FUID WORDS AT FUID BASE     */
	uint32_t calibaddr;	/* CALIBRATION ADDRESS                   */
	uint8_t ncalib;		/* NUMBER OF CALIBRATION WORDS           */
	uint8_t codepanelsize;	/* PROGRAM FLASH PANEL SIZE              */
	uint8_t datapanelsize;	/* DATA EEPROM PANEL SIZE                */
};

/******************************************************************************
 * MEMORY
 *****************************************************************************/

/*
 * MEMORY MAP
 */
#if 0
#define PIC24_CODE_LOW  (0x000000)
#endif
#define PIC24_EXEC_LOW          (0x00800000) /* EXECUTIVE                   */
#define PIC24_GA6_GB6_EXEC_LOW  (0x00800100) /* EXECUTIVE                   */
#define dsPIC30F_APPID_ADDR     (0x008005BE) /* APP ID WORD FOR dsPIC30F    */
#define dsPIC30F_EXEC_HIGH      (0x00800600) /* EXEC + UNIT/FUID            */
#define PIC24_GA6_GB6_EXEC_HIGH (0x00800FFE) /* EXECUTIVE                   */
#define PIC24_APPID_ADDR        (0x008007F0) /* APP ID WORD FOR PIC24FJ     */
#define PIC24_CALIB_ADDR        (0x008007F4) /* up to 6 calibration words   */
#define PIC24_EXEC_HIGH         (0x00800800)
#define dsPIC33EP_APPID_ADDR    (0x00800FF0) /* APP ID WORD FOR dsPIC33EP   */
#define dsPIC33EV_APPID_ADDR    (0x00800BFE) /* APP ID WORD FOR dsPIC33EV?  */
#define dsPIC33E_EXEC_HIGH      (0x00801000) /* EXEC + UNIT/FUID/UDID + OTP */
#define PIC24_CONFIG_ADDR       (0x00F80000) /* base address                */
#define PIC24_CONFIG_MASK       (0x0000FFFF) /* 16-bit word mask            */
#define PIC24_CONFIG_PENDING    (0x80000000) /* config/fuid Write pending   */
#define PIC24_DEVID             (0x00FF0000)
#define PIC24_DEVREV            (0x00FF0002)

/*
 * DEVID / DEVREV
 */
#define PIC24FJ_FAMILY_MASK (0x3FC0) /* FAMID<7:0>                            */
#define PIC24FJ_DEV_MASK    (0x003F) /* DEV  <5:0>                            */
#define PIC24FJ_MAJRV_MASK  (0x01C0) /* MAJRV<2:0>                            */
#define PIC24FJ_DOT_MASK    (0x0007) /* DOT  <2:0>                            */

#define dsPIC30F_MASK        (0xFFC0) /* MASK<9:0>                             */
#define dsPIC30F_VAR_MASK    (0x003F) /* VARIANT<5:0>                          */
#define dsPIC30F_PROC_MASK   (0xF000) /* PROC<3:0> = 0x001                     */
#define dsPIC30F_REV_MASK    (0x0FC0) /* REV <5:0> 0000000=A 000001=B 000010=C */
#define dsPIC30F_DOT_MASK    (0x003F) /* DOT <5:0>                             */

/*
 * PIC24FJ NVCON  NVMOP<3:0>
 *    1111 MEMORY BULK ERASE
 *    0011 MEMORY WRITE WORD
 *    0010 MEMORY PAGE ERASE
 *    0001 MEMORY WRITE ROW
 */
#define PIC24FJ_ERASE_CHIP (0x404F) /* WREN | ERASE  | NVMOP3 | NVMOP2 | NVMOP1 | NVMOP0 */
#define PIC24FJ_WRITE_WORD (0x4003) /* WREN |                            NVMOP1 | NVMOP0 */
#define PIC24FJ_ERASE_PAGE (0x4042) /* WREN | ERASE  |                   NVMOP1          */
#define PIC24FJ_WRITE_ROW  (0x4001) /* WREN |                                     NVMOP0 */
#define PIC24FJ_ERASE_PAGE_SIZE (512)
#define PIC24FJ_WRITE_ROW_SIZE  (64)

#define dsPIC33FJ_ERASE_CHIP (0x404F) /* NEMORY BULK ERASE              */
#define dsPIC33FJ_ERASE_GEN  (0x404D) /* ERASE GENERAL SEGMENT          */
#define dsPIC33FJ_ERASE_PAGE (0x4042) /* PROGRAM MEMORY PAGE ERASE      */
#define dsPIC33FJ_WRITE_WORD (0x4003) /* MEMORY WORD PROGRAM            */
#define dsPIC33FJ_ERASE_PAGE_SIZE (512)
#define dsPIC33FJ_WRITE_ROW_SIZE  (64)

#define dsPIC30F_ERASE_ROW         (0x4071) /* WREN | PROGOP<6:0> 111 0001 */
#define dsPIC30F_ERASE_EXEC        (0x4072) /* WREN | PROGOP<6:0> 111 0010 */
#define dsPIC30F_ERASE_CHIP        (0x407F) /* WREN | PROGOP<6:0> 111 1111 */
#define dsPIC30F_ERASE_GEN         (0x404E) /* WREN | PROGOP<6:0> 100 1110 */
#define dsPIC30F_ERASE_SECGEN      (0x405E) /* WREN | PROGOP<6:0> 101 1110 */
#define dsPIC30F_ERASE_BOOTSECGEN  (0x406E) /* WREN | PROGOP<6:0> 110 1110 */
#define dsPIC30F_ERASE_EEPROM_WORD (0x4074) /* WREN | PROGOP<6:0> 111 0100 */
#define dsPIC30F_ERASE_EEPROM_ROW  (0x4075) /* WREN | PROGOP<6:0> 111 0101 */
#define dsPIC30F_ERASE_EEPROM_GEN  (0x4046) /* WREN | PROGOP<6:0> 100 0110 */
#define dsPIC30F_ERASE_EEPROM_SEC  (0x4056) /* WREN | PROGOP<6:0> 101 0110 */
#define dsPIC30F_ERASE_EEPROM_BOOT (0x4066) /* WREN | PROGOP<6:0> 110 0110 */
#define dsPIC30F_WRITE_EEPROM_ROW  (0x4005)
#define dsPIC30F_WRITE_EEPROM_WORD (0x4004)
#define dsPIC30F_WRITE_ROW         (0x4001)
#define dsPIC30F_WRITE_WORD        (0x4008)
#define dsPIC30F_WRITE_CODE_SIZE (32)
#define dsPIC30F_WRITE_DATA_SIZE (16)

