GBert/misc/pickle-ftdi/src/pic24.h
/******************************************************************************
 * PICMicro devices
 *****************************************************************************/

/*
 * DS39768D
 * 
 * LVP KEY ENTRY
 */
#define DS39768D (39768)
#define PIC24FJ16GA002  (0x0444) /* CONFIG1:002BFE CONFIG2:002BFC (11264) */
#define PIC24FJ16GA004  (0x044C)
#define PIC24FJ32GA002  (0x0445) /* CONFIG1:0057FE CONFIG2:0057FC (22528) */
#define PIC24FJ32GA004  (0x044D)
#define PIC24FJ48GA002  (0x0446) /* CONFIG1:0083FE CONFIG2:0083FC (33792) */
#define PIC24FJ48GA004  (0x044E)
#define PIC24FJ64GA002  (0x0447) /* CONFIG1:00ABFE CONFIG2:00ABFC (44032) */
#define PIC24FJ64GA004  (0x044F)
#define PIC24FJ64GA006  (0x0405)
#define PIC24FJ64GA008  (0x0408)
#define PIC24FJ64GA010  (0x040B)
#define PIC24FJ96GA006  (0x0406) /* CONFIG1:00FFFE CONFIG2:00FFFC (65536) */
#define PIC24FJ96GA008  (0x0409)
#define PIC24FJ96GA010  (0x040C)
#define PIC24FJ128GA006 (0x0407) /* CONFIG1:0157FE CONFIG2:0157FC (88064) */
#define PIC24FJ128GA008 (0x040A)
#define PIC24FJ128GA010 (0x040D)

/*
 * dsPIC30F Flash Programming Specification
 *
 * DO NOT REFER TO DS70102K AS IT CONTAINS INCORRECT INFORMATION
 * REGARDING ICSP MODE ENTRY. USE DS70102H WHICH IS THE LAST
 * KNOWN GOOD VERSION WHICH CORRECTLY DESCRIBES ICSP MODE ENTRY
 * AND THE ALSO THE CORRECT METHOD TO EXIT FROM THE RESET
 * VECTOR UNLIKE ALL LATER DOCUMENTS.
 *
 * 13V HVP 5V VDD
 *
 * DS70102H
 */
#define DS70102H (70102)
#define dsPIC30F2010  (0x0040)
#define dsPIC30F2011  (0x0240)
#define dsPIC30F2012  (0x0241)
#define dsPIC30F3010  (0x01C0)
#define dsPIC30F3011  (0x01C1)
#define dsPIC30F3012  (0x00C1)
#define dsPIC30F3013  (0x00C3)
#define dsPIC30F3014  (0x0160)
#define dsPIC30F4011  (0x0101)
#define dsPIC30F4012  (0x0100)
#define dsPIC30F4013  (0x0141)
#define dsPIC30F5011  (0x0080)
#define dsPIC30F5013  (0x0081)
#define dsPIC30F5015  (0x0200)
#define dsPIC30F5016  (0x0201)
#define dsPIC30F6010  (0x0188) /* MATURE PRODUCT 2013-11-12 */
#define dsPIC30F6010A (0x0281)
#define dsPIC30F6011  (0x0192) /* MATURE PRODUCT 2013-11-12 */
#define dsPIC30F6011A (0x02C0)
#define dsPIC30F6012  (0x0193) /* MATURE PRODUCT 2013-11-12 */
#define dsPIC30F6012A (0x02C2)
#define dsPIC30F6013  (0x0197) /* MATURE PRODUCT 2013-11-12 */
#define dsPIC30F6013A (0x02C1)
#define dsPIC30F6014  (0x0198) /* MATURE PRODUCT 2013-11-12 */
#define dsPIC30F6014A (0x02C3)
#define dsPIC30F6015  (0x0280)

/*
 * DS70659C
 */
#define DS70659C (70659)
#define dsPIC33FJ16GP101  (0x0200)
#define dsPIC33FJ16GP102  (0x0201)
#define dsPIC33FJ32GP101  (0x0A00)
#define dsPIC33FJ32GP102  (0x0A01)
#define dsPIC33FJ32GP104  (0x0A03)
#define dsPIC33FJ16MC101  (0x0202)
#define dsPIC33FJ16MC102  (0x0203)
#define dsPIC33FJ32MC101  (0x0A04)
#define dsPIC33FJ32MC102  (0x0A05)
#define dsPIC33FJ32MC104  (0x0A07)
/* */
#define dsPIC33FJ06GS001  (0x4900)
#define dsPIC33FJ06GS101A (0x4901)
#define dsPIC33FJ06GS102A (0x4904)
#define dsPIC33FJ06GS202A (0x4905)
#define dsPIC33FJ09GS302  (0x4906)

/*
 * DS39919C
 */
#define DS39919C (39919)
#define PIC24F08KA101  (0x0D08)
#define PIC24F16KA101  (0x0D01)
#define PIC24F08KA102  (0x0D0A)
#define PIC24F16KA102  (0x0D03)
/* */
#define PIC24FV16KA301 (0x4509)
#define PIC24FV16KA302 (0x4503)
#define PIC24FV16KA304 (0x4507)
#define PIC24FV32KA301 (0x4519)
#define PIC24FV32KA302 (0x4513)
#define PIC24FV32KA304 (0x4517)
/* */
#define PIC24F16KA301  (0x4508)
#define PIC24F16KA302  (0x4502)
#define PIC24F16KA304  (0x4506)
#define PIC24F32KA301  (0x4518)
#define PIC24F32KA302  (0x4512)
#define PIC24F32KA304  (0x4516)

/*
 * NO FAMILY PROGRAMMING DATA-SHEET AVAILABLE.
 * REFER TO DS39919C ABOVE.
 *
 * DEVID  UNUSED<23:16> FAM<7:0> DEV<7:0> 
 * DEVREV UNUSED<23:4>  REV<3:0>
 */
#define PIC24F04KA200 (0x0D02) /* FAM D DEV 2 */
#define PIC24F04KA201 (0x0D00) /* FAM D REV 0 */

/*
 * DS30625D
 *
 * DEVID  UNUSED<23:16> FAM<7:0> DEV<7:0> 
 * DEVREV UNUSED<23:4>  REV<3:0>
 */
#define DS30625D (30625)
#define PIC24F16KL402  (0x4B14)
#define PIC24F16KL401  (0x4B1E)
#define PIC24F08KL402  (0x4B04)
#define PIC24F08KL401  (0x4B0E)
#define PIC24F08KL302  (0x4B00)
#define PIC24F08KL301  (0x4B0A)
#define PIC24F08KL201  (0x4B06)
#define PIC24F08KL200  (0x4B05)
#define PIC24F04KL101  (0x4B02)
#define PIC24F04KL100  (0x4B01)
#define PIC24FV16KM204 (0x551F)
#define PIC24FV08KM204 (0x5517)
#define PIC24FV16KM104 (0x550F)
#define PIC24FV16KM202 (0x551B)
#define PIC24FV08KM202 (0x5513)
#define PIC24FV16KM102 (0x550B)
#define PIC24FV08KM102 (0x5503)
#define PIC24FV08KM101 (0x5501)
#define PIC24F16KM204  (0x551E)
#define PIC24F08KM204  (0x5516)
#define PIC24F16KM104  (0x550E)
#define PIC24F16KM202  (0x551A)
#define PIC24F08KM202  (0x5512)
#define PIC24F16KM102  (0x550A)
#define PIC24F08KM102  (0x5502)
#define PIC24F08KM101  (0x5500)

/*
 * DS70152H
 */
#define DS70152H (70152)
#define dsPIC33FJ06GS101   (0x0C00)
#define dsPIC33FJ06GS102   (0x0C01)
#define dsPIC33FJ06GS202   (0x0C02)
#define dsPIC33FJ16GS402   (0x0C04)
#define dsPIC33FJ16GS404   (0x0C06)
#define dsPIC33FJ16GS502   (0x0C03)
#define dsPIC33FJ16GS504   (0x0C05)
#define dsPIC33FJ12GP201   (0x0802)
#define dsPIC33FJ12GP202   (0x0803)
#define dsPIC33FJ12MC201   (0x0800)
#define dsPIC33FJ12MC202   (0x0801)
#define PIC24HJ12GP201     (0x080A)
#define PIC24HJ12GP202     (0x080B)
#define dsPIC33FJ16GP304   (0x0F07)
#define dsPIC33FJ16MC304   (0x0F03)
#define PIC24HJ16GP304     (0x0F17)
#define dsPIC33FJ32GP202   (0x0F0D)
#define dsPIC33FJ32GP204   (0x0F0F)
#define dsPIC33FJ32MC202   (0x0F09)
#define dsPIC33FJ32MC204   (0x0F0B)
#define PIC24HJ32GP202     (0x0F1D)
#define PIC24HJ32GP204     (0x0F1F)
#define dsPIC33FJ64GP206   (0x00C1)
#define dsPIC33FJ64GP306   (0x00CD)
#define dsPIC33FJ64GP310   (0x00CF)
#define dsPIC33FJ64GP706   (0x00D5)
#define dsPIC33FJ64GP708   (0x00D6)
#define dsPIC33FJ64GP710   (0x00D7)
#define dsPIC33FJ64MC506   (0x0089)
#define dsPIC33FJ64MC508   (0x008A)
#define dsPIC33FJ64MC510   (0x008B)
#define dsPIC33FJ64MC706   (0x0091)
#define dsPIC33FJ64MC710   (0x0097)
#define PIC24HJ64GP206     (0x0041)
#define PIC24HJ64GP210     (0x0047)
#define PIC24HJ64GP506     (0x0049)
#define PIC24HJ64GP510     (0x004B)
#define dsPIC33FJ128GP206  (0x00D9)
#define dsPIC33FJ128GP306  (0x00E5)
#define dsPIC33FJ128GP310  (0x00E7)
#define dsPIC33FJ128GP706  (0x00ED)
#define dsPIC33FJ128GP708  (0x00EE)
#define dsPIC33FJ128GP710  (0x00EF)
#define dsPIC33FJ128MC506  (0x00A1)
#define dsPIC33FJ128MC510  (0x00A3)
#define dsPIC33FJ128MC706  (0x00A9)
#define dsPIC33FJ128MC708  (0x00AE)
#define dsPIC33FJ128MC710  (0x00AF)
#define PIC24HJ128GP206    (0x005D)
#define PIC24HJ128GP210    (0x005F)
#define PIC24HJ128GP306    (0x0065)
#define PIC24HJ128GP310    (0x0067)
#define PIC24HJ128GP506    (0x0061)
#define PIC24HJ128GP510    (0x0063)
#define dsPIC33FJ256GP506  (0x00F5)
#define dsPIC33FJ256GP510  (0x00F7)
#define dsPIC33FJ256GP710  (0x00FF)
#define dsPIC33FJ256MC510  (0x00B7)
#define dsPIC33FJ256MC710  (0x00BF)
#define PIC24HJ256GP206    (0x0071)
#define PIC24HJ256GP210    (0x0073)
#define PIC24HJ256GP610    (0x007B)
#define dsPIC33FJ32GP302   (0x0605)
#define dsPIC33FJ32GP304   (0x0607)
#define dsPIC33FJ32MC302   (0x0601)
#define dsPIC33FJ32MC304   (0x0603)
#define dsPIC33FJ64GP202   (0x0615)
#define dsPIC33FJ64GP204   (0x0617)
#define dsPIC33FJ64GP802   (0x061D)
#define dsPIC33FJ64GP804   (0x061F)
#define dsPIC33FJ64MC202   (0x0611)
#define dsPIC33FJ64MC204   (0x0613)
#define dsPIC33FJ64MC802   (0x0619)
#define dsPIC33FJ64MC804   (0x061B)
#define dsPIC33FJ128GP202  (0x0625)
#define dsPIC33FJ128GP204  (0x0627)
#define dsPIC33FJ128GP802  (0x062D)
#define dsPIC33FJ128GP804  (0x062F)
#define dsPIC33FJ128MC202  (0x0621)
#define dsPIC33FJ128MC204  (0x0623)
#define dsPIC33FJ128MC802  (0x0629)
#define dsPIC33FJ128MC804  (0x062B)
#define PIC24HJ32GP302     (0x0645)
#define PIC24HJ32GP304     (0x0647)
#define PIC24HJ64GP202     (0x0655)
#define PIC24HJ64GP204     (0x0657)
#define PIC24HJ64GP502     (0x0675)
#define PIC24HJ64GP504     (0x0677)
#define PIC24HJ128GP202    (0x0665)
#define PIC24HJ128GP204    (0x0667)
#define PIC24HJ128GP502    (0x067D)
#define PIC24HJ128GP504    (0x067F)
#define dsPIC33FJ64GP206A  (0x00C1)
#define dsPIC33FJ64GP306A  (0x00CD)
#define dsPIC33FJ64GP310A  (0x00CF)
#define dsPIC33FJ64GP706A  (0x00D5)
#define dsPIC33FJ64GP708A  (0x00D6)
#define dsPIC33FJ64GP710A  (0x00D7)
#define dsPIC33FJ64MC506A  (0x0089)
#define dsPIC33FJ64MC508A  (0x008A)
#define dsPIC33FJ64MC510A  (0x008B)
#define dsPIC33FJ64MC706A  (0x0091)
#define dsPIC33FJ64MC710A  (0x0097)
#define PIC24HJ64GP206A    (0x0041)
#define PIC24HJ64GP210A    (0x0047)
#define PIC24HJ64GP506A    (0x0049)
#define PIC24HJ64GP510A    (0x004B)
#define dsPIC33FJ128GP206A (0x00D9)
#define dsPIC33FJ128GP306A (0x00E5)
#define dsPIC33FJ128GP310A (0x00E7)
#define dsPIC33FJ128GP706A (0x00ED)
#define dsPIC33FJ128GP708A (0x00EE)
#define dsPIC33FJ128GP710A (0x00EF)
#define dsPIC33FJ128MC506A (0x00A1)
#define dsPIC33FJ128MC510A (0x00A3)
#define dsPIC33FJ128MC706A (0x00A9)
#define dsPIC33FJ128MC708A (0x00AE)
#define dsPIC33FJ128MC710A (0x00AF)
#define PIC24HJ128GP206A   (0x005D)
#define PIC24HJ128GP210A   (0x005F)
#define PIC24HJ128GP306A   (0x0065)
#define PIC24HJ128GP310A   (0x0067)
#define PIC24HJ128GP506A   (0x0061)
#define PIC24HJ128GP510A   (0x0063)
#define dsPIC33FJ256GP506A (0x07F5)
#define dsPIC33FJ256GP510A (0x07F7)
#define dsPIC33FJ256GP710A (0x07FF)
#define dsPIC33FJ256MC510A (0x07B7)
#define dsPIC33FJ256MC710A (0x07BF)
#define PIC24HJ256GP206A   (0x0771)
#define PIC24HJ256GP210A   (0x0773)
#define PIC24HJ256GP610A   (0x077B)
#define dsPIC33FJ32GS406   (0x4000)
#define dsPIC33FJ64GS406   (0x4001)
#define dsPIC33FJ32GS606   (0x4002)
#define dsPIC33FJ64GS606   (0x4003)
#define dsPIC33FJ32GS608   (0x4004)
#define dsPIC33FJ64GS608   (0x4005)
#define dsPIC33FJ32GS610   (0x4006)
#define dsPIC33FJ64GS610   (0x4007)

