GBert/misc/pickle-ftdi/src/pic24.h
/*
 * DS70663D
 */
#define DS70663D (70663)
#define PIC24EP32GP202    (0x1C19)
#define PIC24EP32GP203    (0x1C1A)
#define PIC24EP32GP204    (0x1C18)
#define dsPIC33EP32GP502  (0x1C0D)
#define dsPIC33EP32GP503  (0x1C0E)
#define dsPIC33EP32GP504  (0x1C0C)
#define PIC24EP32MC202    (0x1C11)
#define PIC24EP32MC203    (0x1C12)
#define PIC24EP32MC204    (0x1C10)
#define dsPIC33EP32MC202  (0x1C01)
#define dsPIC33EP32MC203  (0x1C02)
#define dsPIC33EP32MC204  (0x1C00)
#define dsPIC33EP32MC502  (0x1C05)
#define dsPIC33EP32MC503  (0x1C06)
#define dsPIC33EP32MC504  (0x1C04)
#define PIC24EP64GP202    (0x1D39)
#define PIC24EP64GP203    (0x1D3A)
#define PIC24EP64GP204    (0x1D38)
#define PIC24EP64GP206    (0x1D3B)
#define dsPIC33EP64GP502  (0x1D2D)
#define dsPIC33EP64GP503  (0x1D2E)
#define dsPIC33EP64GP504  (0x1D2C)
#define dsPIC33EP64GP506  (0x1D2F)
#define PIC24EP64MC202    (0x1D31)
#define PIC24EP64MC203    (0x1D32)
#define PIC24EP64MC204    (0x1D30)
#define PIC24EP64MC206    (0x1D33)
#define dsPIC33EP64MC202  (0x1D21)
#define dsPIC33EP64MC203  (0x1D22)
#define dsPIC33EP64MC204  (0x1D20)
#define dsPIC33EP64MC206  (0x1D23)
#define dsPIC33EP64MC502  (0x1D25)
#define dsPIC33EP64MC503  (0x1D26)
#define dsPIC33EP64MC504  (0x1D24)
#define dsPIC33EP64MC506  (0x1D27)
#define PIC24EP128GP202   (0x1E59)
#define PIC24EP128GP204   (0x1E58)
#define PIC24EP128GP206   (0x1E5B)
#define dsPIC33EP128GP502 (0x1E4D)
#define dsPIC33EP128GP504 (0x1E4C)
#define dsPIC33EP128GP506 (0x1E4F)
#define PIC24EP128MC202   (0x1E51)
#define PIC24EP128MC204   (0x1E50)
#define PIC24EP128MC206   (0x1E53)
#define dsPIC33EP128MC202 (0x1E41)
#define dsPIC33EP128MC204 (0x1E40)
#define dsPIC33EP128MC206 (0x1E43)
#define dsPIC33EP128MC502 (0x1E45)
#define dsPIC33EP128MC504 (0x1E44)
#define dsPIC33EP128MC506 (0x1E47)
#define PIC24EP256GP202   (0x1F79)
#define PIC24EP256GP204   (0x1F78)
#define PIC24EP256GP206   (0x1F7B)
#define dsPIC33EP256GP502 (0x1F6D)
#define dsPIC33EP256GP504 (0x1F6C)
#define dsPIC33EP256GP506 (0x1F6F)
#define PIC24EP256MC202   (0x1F71)
#define PIC24EP256MC204   (0x1F70)
#define PIC24EP256MC206   (0x1F73)
#define dsPIC33EP256MC202 (0x1F61)
#define dsPIC33EP256MC204 (0x1F60)
#define dsPIC33EP256MC206 (0x1F63)
#define dsPIC33EP256MC502 (0x1F65)
#define dsPIC33EP256MC504 (0x1F64)
#define dsPIC33EP256MC506 (0x1F67)
#define PIC24EP512GP202   (0x1799)
#define PIC24EP512GP204   (0x1798)
#define PIC24EP512GP206   (0x179B)
#define dsPIC33EP512GP502 (0x178D)
#define dsPIC33EP512GP504 (0x178C)
#define dsPIC33EP512GP506 (0x178F)
#define PIC24EP512MC202   (0x1791)
#define PIC24EP512MC204   (0x1790)
#define PIC24EP512MC206   (0x1793)
#define dsPIC33EP512MC202 (0x1781)
#define dsPIC33EP512MC204 (0x1780)
#define dsPIC33EP512MC206 (0x1783)
#define dsPIC33EP512MC502 (0x1785)
#define dsPIC33EP512MC504 (0x1784)
#define dsPIC33EP512MC506 (0x1787)

/*
 * dsPIC30F SMPS (switch mode power supply) Flash Programming Specification
 *
 * LVP(KEY)
 *
 * DS70284B
 */
#define DS70284B (70284)
#define dsPIC30F1010 (0x0404)
#define dsPIC30F2020 (0x0400)
#define dsPIC30F2023 (0x0403)

/*
 * DS75012B
 */
#define DS75012B (75012)
#define PIC24FJ16MC101 (0x0206)
#define PIC24FJ16MC102 (0x0207)
#define PIC24FJ32MC101 (0x0A0C)
#define PIC24FJ32MC102 (0x0A0D)
#define PIC24FJ32MC104 (0x0A0F)

/*
 * DS39934B / DS30009934C
 */
#define DS39934B (39934)
#define PIC24FJ32GA102 (0x4202)
#define PIC24FJ64GA102 (0x4206)
#define PIC24FJ32GA104 (0x420A)
#define PIC24FJ64GA104 (0x420E)
#define PIC24FJ32GB002 (0x4203)
#define PIC24FJ64GB002 (0x4207)
#define PIC24FJ32GB004 (0x420B)
#define PIC24FJ64GB004 (0x420F)

/*
 * DS30009907C
 */
#define DS30009907C (30009907)
#define PIC24FJ64GA106  (0x1000)
#define PIC24FJ128GA106 (0x1008)
#define PIC24FJ192GA106 (0x1010)
#define PIC24FJ256GA106 (0x1018)
#define PIC24FJ64GA108  (0x1002)
#define PIC24FJ128GA108 (0x100A)
#define PIC24FJ192GA108 (0x1012)
#define PIC24FJ256GA108 (0x101A)
#define PIC24FJ64GA110  (0x1006)
#define PIC24FJ128GA110 (0x100E)
#define PIC24FJ192GA110 (0x1016)
#define PIC24FJ256GA110 (0x101E)
#define PIC24FJ64GB106  (0x1001)
#define PIC24FJ128GB106 (0x1009)
#define PIC24FJ192GB106 (0x1011)
#define PIC24FJ256GB106 (0x1019)
#define PIC24FJ64GB108  (0x1003)
#define PIC24FJ128GB108 (0x100B)
#define PIC24FJ192GB108 (0x1013)
#define PIC24FJ256GB108 (0x101B)
#define PIC24FJ64GB110  (0x1007)
#define PIC24FJ128GB110 (0x100F)
#define PIC24FJ192GB110 (0x1017)
#define PIC24FJ256GB110 (0x101F)

/*
 * DS39970E
 */
#define DS39970E (39970)
#define PIC24FJ128DA106 (0x4109)
#define PIC24FJ256DA106 (0x410D)
#define PIC24FJ128DA110 (0x410B)
#define PIC24FJ256DA110 (0x410F)
#define PIC24FJ128DA206 (0x4108)
#define PIC24FJ256DA206 (0x410C)
#define PIC24FJ128DA210 (0x410A)
#define PIC24FJ256DA210 (0x410E)
#define PIC24FJ64GA306  (0x46C0)
#define PIC24FJ64GA308  (0x46C4)
#define PIC24FJ64GA310  (0x46C8)
#define PIC24FJ128GA306 (0x46C2)
#define PIC24FJ128GA308 (0x46C6)
#define PIC24FJ128GA310 (0x46CA)
#define PIC24FJ128GB206 (0x4100)
#define PIC24FJ256GB206 (0x4104)
#define PIC24FJ128GB210 (0x4102)
#define PIC24FJ256GB210 (0x4106)
#define PIC24FJ64GC006  (0x4888)
#define PIC24FJ64GC008  (0x488A)
#define PIC24FJ64GC010  (0x4884)
#define PIC24FJ128GC006 (0x4889)
#define PIC24FJ128GC008 (0x488B)
#define PIC24FJ128GC010 (0x4885)

/*
 * DS30000510E
 */
#define DS30000510E (30000510)
#define PIC24FJ128GB204 (0x4C5B)
#define PIC24FJ128GB202 (0x4C5A)
#define PIC24FJ64GB204  (0x4C59)
#define PIC24FJ64GB202  (0x4C58)
#define PIC24FJ128GA204 (0x4C53)
#define PIC24FJ128GA202 (0x4C52)
#define PIC24FJ64GA204  (0x4C51)
#define PIC24FJ64GA202  (0x4C50)

/*
 * DS30010073A
 */
#define DS30010073A (30010073)
#define PIC24FJ64GA406  (0x6100)
#define PIC24FJ64GA410  (0x6101)
#define PIC24FJ64GA412  (0x6102)
#define PIC24FJ64GB406  (0x6104)
#define PIC24FJ64GB410  (0x6105)
#define PIC24FJ64GB412  (0x6106)
#define PIC24FJ128GA406 (0x6108)
#define PIC24FJ128GA410 (0x6109)
#define PIC24FJ128GA412 (0x610A)
#define PIC24FJ128GB406 (0x610C)
#define PIC24FJ128GB410 (0x610D)
#define PIC24FJ128GB412 (0x610E)
#define PIC24FJ256GA406 (0x6110)
#define PIC24FJ256GA410 (0x6111)
#define PIC24FJ256GA412 (0x6112)
#define PIC24FJ256GB406 (0x6114)
#define PIC24FJ256GB410 (0x6115)
#define PIC24FJ256GB412 (0x6116)

