GBert/misc/pickle-ftdi/src/pic24.h
/*
 * DS30010057F
 */
#define DS30010057F (30010057)
#define PIC24FJ128GA606  (0x6000)
#define PIC24FJ256GA606  (0x6008)
#define PIC24FJ512GA606  (0x6010)
#define PIC24FJ1024GA606 (0x6018)
#define PIC24FJ128GA610  (0x6001)
#define PIC24FJ256GA610  (0x6009)
#define PIC24FJ512GA610  (0x6011)
#define PIC24FJ1024GA610 (0x6019)
#define PIC24FJ128GB606  (0x6004)
#define PIC24FJ256GB606  (0x600C)
#define PIC24FJ512GB606  (0x6014)
#define PIC24FJ1024GB606 (0x601C)
#define PIC24FJ128GB610  (0x6005)
#define PIC24FJ256GB610  (0x600D)
#define PIC24FJ512GB610  (0x6015)
#define PIC24FJ1024GB610 (0x601D)

/*
 * DS70005137F
 */
#define DS70005137F (70005137)
#define dsPIC33EV32GM002  (0x5D01)
#define dsPIC33EV32GM004  (0x5D00)
#define dsPIC33EV32GM006  (0x5D03)
#define dsPIC33EV32GM102  (0x5D09)
#define dsPIC33EV32GM104  (0x5D08)
#define dsPIC33EV32GM106  (0x5D0B)
#define dsPIC33EV64GM002  (0x5D11)
#define dsPIC33EV64GM004  (0x5D10)
#define dsPIC33EV64GM006  (0x5D13)
#define dsPIC33EV64GM102  (0x5D19)
#define dsPIC33EV64GM104  (0x5D18)
#define dsPIC33EV64GM106  (0x5D1B)
#define dsPIC33EV128GM002 (0x5D21)
#define dsPIC33EV128GM004 (0x5D20)
#define dsPIC33EV128GM006 (0x5D23)
#define dsPIC33EV128GM102 (0x5D29)
#define dsPIC33EV128GM104 (0x5D28)
#define dsPIC33EV128GM106 (0x5D2B)
#define dsPIC33EV256GM002 (0x5D31)
#define dsPIC33EV256GM004 (0x5D30)
#define dsPIC33EV256GM006 (0x5D33)
#define dsPIC33EV256GM102 (0x5D39)
#define dsPIC33EV256GM104 (0x5D38)
#define dsPIC33EV256GM106 (0x5D3B)

/*
 * DS30010102A
 */
#define DS30010102A (30010102)
#define PIC24FJ64GA702  (0x7506)
#define PIC24FJ128GA702 (0x750A)
#define PIC24FJ256GA702 (0x750E)
#define PIC24FJ64GA704  (0x7505)
#define PIC24FJ128GA704 (0x7509)
#define PIC24FJ256GA704 (0x750D)
#define PIC24FJ64GA705  (0x7507)
#define PIC24FJ128GA705 (0x750B)
#define PIC24FJ256GA705 (0x750F)

/******************************************************************************/

#define _PCL (0x002E)
uint32_t pic24_arch(void);
void pic24_selector(void);
void pic24_program_verify(void);
void pic24_standby(void);
void pic24_goto200(void);
uint16_t pic24_readreg(uint16_t);
void pic24_set_read_pointer(uint32_t);
void pic24_set_write_pointer(uint32_t);
void pic24_set_write_pointer_nvmadr(uint32_t);
uint32_t pic24_table_read24_post_increment(void);
void pic24_table_read48_post_increment(uint32_t *, uint32_t *);
void pic24_nvmcon_write_completion(uint16_t, uint16_t);
void pic24_nvmcon_write_external(uint32_t);
void pic24_bulk_erase(void);
int pic24_read_config_memory(void);
uint32_t pic24_get_program_size(uint32_t *);
uint32_t pic24_get_data_size(uint32_t *);
uint32_t pic24_get_executive_size(uint32_t *);
uint32_t pic24_read_program_memory_block(uint32_t *, uint32_t, uint32_t);
uint32_t pic24_read_data_memory_block(uint16_t *, uint32_t, uint16_t);
void pic24_write_program_init(void);
void pic24_write_program(uint32_t, uint32_t *, uint32_t);
uint32_t pic24_has_config(void);
void pic24_write_panel(uint32_t, uint32_t, uint32_t *, uint32_t);
void pic24_write_config_init1(void);
void pic24_write_config_init2(void);
void pic24_write_config_word(uint32_t, uint16_t);
uint32_t pic24_write_config_words(void);
uint32_t pic24_write_fuid_words(void);
uint32_t pic24_write_config(void);
uint32_t pic24_getregion(uint32_t);
void pic24_program_begin(void);
uint32_t pic24_program_data(uint32_t, pic_data *);
void pic24_program_end(int);
uint32_t pic24_verify_data(uint32_t, pic_data *, uint32_t *);
void pic24_view_data(pic_data *);
void pic24_dumpdeviceid(void);
void pic24_dumpconfig(int);
void pic24_dumpconfig_verbose(void);
void pic24_dumphexcode(uint32_t, uint32_t, uint32_t *);
void pic24_dumpinhxcode(uint32_t, uint32_t, uint32_t *);
void pic24_dumphexdata(uint32_t, uint32_t, uint16_t *);
void pic24_dumpinhxdata(uint32_t, uint32_t, uint16_t *);
void pic24_dumpdevice(void);

#endif /* !_PIC24_H */
